# Taps
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/bundle"

# Brew packages
brew "git"
brew "git-extras"
brew "stow"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "exa"
brew "fd"
brew "jq"
brew "yq"
brew "wget"
brew "curl"
brew "openssl"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"
brew "tldr"
brew "htop"
brew "tmux"
brew "neovim"
brew "python"
brew "node"
brew "ruby"
brew "go"
brew "rust"
brew "flutter"

# Cask packages
cask "visual-studio-code"
cask "iterm2"
cask "alfred"
cask "rectangle"
cask "karabiner-elements"
cask "hammerspoon"
cask "docker"
cask "postman"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "google-chrome"
cask "firefox"
cask "brave-browser" 